---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElementWarn
source: html/66fc8d10-b714-4fa6-588b-95fed4f84b85.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElementWarn Property

Can't move element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveElementWarn { get; }
```